Hdchipeo/posture-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Compiler Options
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# HTTP Server & WebSocket Configuration
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_MAX_OPEN_SOCKETS=7
CONFIG_LWIP_MAX_SOCKETS=16

